{
    "version": "https://jsonfeed.org/version/1",
    "title": "Fleet Services",
    "description": "",
    "home_page_url": "https://automaniacmrk.github.io/fleetservices",
    "feed_url": "https://automaniacmrk.github.io/fleetservices/feed.json",
    "user_comment": "",
    "author": {
        "name": "Mechanic"
    },
    "items": [
        {
            "id": "https://automaniacmrk.github.io/fleetservices/aquisition-and-fleet-selection.html",
            "url": "https://automaniacmrk.github.io/fleetservices/aquisition-and-fleet-selection.html",
            "title": "Aquisition and Fleet Selection",
            "summary": "Aquisition and Fleet Selection This is the ideal alternative for smaller local or regional fleets service that are limited to a specific geographical area and want the convenience of consolidated billing. It can be difficult to choose the best vehicles for your fleet. There are&hellip;",
            "content_html": "<h1>Aquisition and Fleet Selection</h1>\n<p><img loading=\"lazy\" src=\"https://momentumfleetservices.com/wp-content/uploads/2020/12/zOWT.jpg\" data-is-external-image=\"true\"  alt=\"Fleet Services\" data-cke-saved-src=\" https://momentumfleetservices.com/wp-content/uploads/2020/12/zOWT.jpg\"></p>\n<h2>Did You Know?</h2>\n<ul>\n<li>A 30-minute \"While you Wait\" basic 14-point maintenance inspection is available by appointment for any County owned vehicle.</li>\n<li>We have lower rates for smog check and preventive maintenance because of the technology we use within our garage.</li>\n<li>The Quality Control Program provides assurance to our customers of the excellent work being performed by our staff.</li>\n<li>Only 10% of Fleet Services' work is outsourced (ex: Wheel alignments and transmission overhauls).</li>\n</ul>\n<h2>Local Billed Fleet</h2>\n<p>This is the ideal alternative for smaller <a href=\"https://www.gooil.ca/fleet\">local or regional fleets service</a> that are limited to a specific geographical area and want the convenience of consolidated billing.</p>\n<p><img loading=\"lazy\" src=\"https://img1.wsimg.com/isteam/ip/fae55827-8ac8-44c5-a4c7-24da1dd3b8ab/AE14AFA5-758C-4339-9D86-7CEFFDE09C23.jpeg/:/cr=t:0%25\" data-is-external-image=\"true\"  alt=\"Fleet Services\" data-cke-saved-src=\" https://img1.wsimg.com/isteam/ip/fae55827-8ac8-44c5-a4c7-24da1dd3b8ab/AE14AFA5-758C-4339-9D86-7CEFFDE09C23.jpeg/:/cr=t:0%25\"></p>\n<h2>Aquisition and Fleet Selection</h2>\n<p>It can be difficult to choose the best vehicles for your fleet. There are hundreds of makes and models to choose from, and the manufacturers always have nice things to say about a vehicle. A fleet service expert like Go Oil can help you choose the right vehicle for your business.</p>\n<p>They know the difference between a loud engine and hauling power. They can identify the kind of seat needed for all-day drivers versus special assignment drivers. You can tell which vehicles get better mileage in urban areas versus those that are used for rural purposes.</p>",
            "author": {
                "name": "Mechanic"
            },
            "tags": [
            ],
            "date_published": "2022-07-12T06:02:21-07:00",
            "date_modified": "2022-07-12T06:22:36-07:00"
        },
        {
            "id": "https://automaniacmrk.github.io/fleetservices/fleet-services-building-map.html",
            "url": "https://automaniacmrk.github.io/fleetservices/fleet-services-building-map.html",
            "title": "Fleet Services Building (Map)",
            "summary": "Fleet Services Building (Map) All University holidays are closed for the Fleet Services office, which includes both rental and shop operations. Instead of purchasing a vehicle, departments can request a long-term lease vehicle from Fleet Services. Please review the long term lease agreement for information.",
            "content_html": "<h2>Fleet Services Building (Map)</h2>\n<p>All University holidays are closed for the Fleet Services office, which includes both rental and shop operations.</p>\n<h2>Long Term Lease Program</h2>\n<p>Instead of purchasing a vehicle, departments can request a long-term lease vehicle from Fleet Services. Please review the long term lease agreement for information.</p>\n<h2>License And Title Management</h2>\n<p>One of the most tedious aspects of fleet management is keeping track of all the licenses and titles for each vehicle. Go Oil's <a href=\"https://www.gooil.ca/fleet\">fleet management services</a> are able to take that burden off of your shoulders. If you don't want to worry about the licenses and titles of the dozen vehicles in your fleet, you don't have to.</p>\n<p>An excellent fleet service program will easily make use of the company's vehicle administration solutions in order to ensure that all your fleet vehicles have been licensed and kept up-to-date.</p>",
            "author": {
                "name": "Mechanic"
            },
            "tags": [
            ],
            "date_published": "2022-07-12T06:00:43-07:00",
            "date_modified": "2022-07-12T06:18:49-07:00"
        },
        {
            "id": "https://automaniacmrk.github.io/fleetservices/fleet-optimization-and-analysis.html",
            "url": "https://automaniacmrk.github.io/fleetservices/fleet-optimization-and-analysis.html",
            "title": "Fleet Optimization and Analysis",
            "summary": "Fleet Optimization and Analysis You can optimize your fleet's with fleet services performance. There is always improvement in business. With vehicles, this can often be seen as schedule tightness or driver satisfaction. You might get better mileage with different vehicles or maintenance choices. Or there&hellip;",
            "content_html": "<h2>Fleet Optimization and Analysis</h2>\n<p>You can optimize your fleet's with <a href=\"https://www.gooil.ca/fleet\">fleet services performance</a>. There is always improvement in business. With vehicles, this can often be seen as schedule tightness or driver satisfaction.</p>\n<p>You might get better mileage with different vehicles or maintenance choices. Or there might be vehicles that offer better driver technology that could streamline your on-the-road workflow. You might also have cars that have reached the end of their useful life.</p>\n<p>We can help you identify where you're losing efficiency or could streamline your fleet management to get the performance metrics you're looking for. Fleet services can help you analyze and improve your fleet, whether it's a new leased vehicle or an upgrade to the driver technology. Your fleet services team will help or assist you in implementing the optimization changes once the plan has been established.</p>\n<p><img loading=\"lazy\" src=\"https://www.depts.ttu.edu/services/FleetServices/Pictures/Rental.jpg\" data-is-external-image=\"true\"  alt=\"Fleet Services\" data-cke-saved-src=\" https://www.depts.ttu.edu/services/FleetServices/Pictures/Rental.jpg\"></p>\n<h2>Fuel Card Program</h2>\n<p>Want to implement fuel cards for your team? Fleet services can do that for you as well. It is important to not ask drivers for company gas reimbursements when they have cars on the roads. However, it is important not to offer drivers a \"blank check\" that could be used for everything from gas fraud to road snacks.</p>\n<p>The solution is in the fuel cards. A well-designed fuelcard can be used to make gas payments and limit spending to ensure that everything stays on the table.</p>\n<p>Go Oil has a Fuel Card that can be used at more than 180K locations across the country. It also provides spending limits for drivers and detailed spending reports that detail line item spending to make sure that fuel costs and other expenses are taken care of.</p>",
            "author": {
                "name": "Mechanic"
            },
            "tags": [
            ],
            "date_published": "2022-07-12T05:59:58-07:00",
            "date_modified": "2022-07-12T06:15:55-07:00"
        },
        {
            "id": "https://automaniacmrk.github.io/fleetservices/rent-a-vehicle.html",
            "url": "https://automaniacmrk.github.io/fleetservices/rent-a-vehicle.html",
            "title": "Rent A Fleet Service Vehicle",
            "summary": "Rent a vehicle Requesting a rental from Go Oil is quick and easy using the Vehicle Rental Request form. This Fleet Services system offers: The Fleet Program Manager will assist departments in the purchase process. He or she will coordinate with Purchasing and Business Systems&hellip;",
            "content_html": "<h2><img loading=\"lazy\" src=\"https://www.eliteonsitefleet.com/custom/garage_sm.png\" data-is-external-image=\"true\"  alt=\"Fleet Services\" data-cke-saved-src=\" https://www.eliteonsitefleet.com/custom/garage_sm.png\"></h2>\n<h2>Rent a vehicle</h2>\n<p>Requesting a rental from Go Oil is quick and easy using the Vehicle Rental Request form. This <a href=\"https://www.gooil.ca/fleet\">Fleet Services system</a> offers:</p>\n<ul>\n<li>NAU CAS Login - Use PeopleSoft to fill in the fields</li>\n<li>Automated emails. First email confirms request has been submitted. Second email confirms Fleet Services has either 1) approved the request, 2) needs more information, or 3) has denied the request (very rare). The email is sent to the submitter, requester and driver.</li>\n<li>You can include multiple vehicles and vehicle types as well as drivers.</li>\n<li>Option to request Enterprise departure locations outside of NAU campus.</li>\n<li>NAU as well as outside vendors can provide information about available classes of vehicles.</li>\n<li>Calculator with built-in rates for estimates</li>\n</ul>\n<h2>Purchase</h2>\n<p>The Fleet Program Manager will assist departments in the purchase process. He or she will coordinate with Purchasing and Business Systems so that you can buy the vehicles as soon as possible. Please see PUR 211: Vehicles for more information on the procurement of vehicles.</p>\n<p>Vehicle failures and emergencies</p>\n<p>American Five Star, The Car Shop and RC 2 Automotive service fuel-powered vehicles. Electric trucks and carts are serviced at Naumann/Hobbs and Electric Vehicle Company.</p>\n<p>ARS 41-803 (C) requires that costs for maintenance and operation of all state-owned vehicles be reported to the Arizona Department of Administration annually. Departments may maintain their vehicles outside of the program. However, departments must report the vehicle's maintenance and repair history to the Fleet Program Manager. As long as you can identify the vehicle and provide details about what services were provided, copies of bills for maintenance or repair should be sufficient.</p>",
            "author": {
                "name": "Mechanic"
            },
            "tags": [
            ],
            "date_published": "2022-07-12T05:59:34-07:00",
            "date_modified": "2022-07-12T06:11:39-07:00"
        },
        {
            "id": "https://automaniacmrk.github.io/fleetservices/fleet-services.html",
            "url": "https://automaniacmrk.github.io/fleetservices/fleet-services.html",
            "title": "Fleet Services",
            "summary": "Fleet Services Fleet Analysis And Optimization You can optimize your fleet's performance with fleet services. There is always improvement in business. With vehicles, this can often be seen as schedule tightness or driver satisfaction. Different vehicles, or a different choice in maintenance, might provide you&hellip;",
            "content_html": "<h1>Fleet Services</h1>\n<h2><img loading=\"lazy\" src=\"https://media-exp2.licdn.com/dms/image/C560BAQFAwVgkvUOZGw/company-logo_200_200/0/1654185603091?e=2147483647&amp;v=beta&amp;t=i9UqMmNxu-vGKnkQC_HT7p9UJiQCY7e_yCyoyU6bbEA\" data-is-external-image=\"true\"  alt=\"Fleet Services\" width=\"80%\" height=\"auto\"></h2>\n<h2>Fleet Analysis And Optimization</h2>\n<p>You can optimize your fleet's performance with fleet services. There is always improvement in business. With vehicles, this can often be seen as schedule tightness or driver satisfaction.</p>\n<p>Different vehicles, or a different choice in maintenance, might provide you with better gas mileage per vehicle. You might also find vehicles with better driver technology, which could simplify your road-trip. You might also have cars that are past their prime years.</p>\n<p>Our fleet services can assist you in identifying areas where efficiency is low or streamline your fleet management so you get the results you want. Fleet services can help you analyze and improve your fleet, whether it's a new leased vehicle or an upgrade to the driver technology. Once a plan is set out, your fleet services team can take care of or help you implement the optimizing changes.</p>\n<h2>Fuel Card Program</h2>\n<p>Want to implement fuel cards for your team? Fleet services can do that for you as well. Any time you have vehicles on the road, it's important that drivers not be asked to cover company gas out of pocket. However, it is important not to offer drivers a \"blank check\" that could be used for everything from gas fraud to road snacks.</p>\n<p>Fuel cards are the solution to both problems because a well-designed fuel card can provide an easy way to pay for gas while also limiting spending on a daily or weekly basis to keep everything on the table.</p>\n<p>Go Oil offers a fuel card that is accepted at over 180K locations nationwide, provides driver spending limits, and creates detailed line-item spending reports to ensure that gas costs are always taken care of and expenses are kept entirely above-board.</p>\n<h2><img loading=\"lazy\" src=\"https://www.maxxfleetservicesllc.com/custom/truck_am.jpg\" data-is-external-image=\"true\"  alt=\"Fleet Services\" width=\"80%\" height=\"auto\"></h2>\n<h2>Buy</h2>\n<p>Departments begin the purchasing process by contacting the Fleet Program Manager, who will work with you and Purchasing and Business Systems to assure the timely purchase of acceptable vehicles. Please see PUR 211: Vehicles for more information on the procurement of vehicles.</p>\n<p>Vehicle failures and emergencies</p>\n<p>American Five Star, The Car Shop and RC 2 Automotive service fuel-powered vehicles. Electric trucks and carts are serviced at Naumann/Hobbs and Electric Vehicle Company.</p>\n<p>The Arizona Department of Administration (ARS 41-803(C) mandates that all costs related to maintenance or operation of state-owned vehicles must be reported annually. The program allows departments to maintain their vehicles without reporting any costs. However, departments must report the vehicle's maintenance and repair history to the Fleet Program Manager. As long as you can identify the vehicle and provide details about what services were provided, copies of bills for maintenance or repair should be sufficient.</p>\n<h2>Rent a vehicle</h2>\n<p>Requesting a rental from Fleet is quick and easy using the Vehicle Rental Request form. The following features are available:</p>\n<ul>\n<li>NAU CAS login utilizing PeopleSoft to autofill fields.</li>\n<li>Automatic emails. The first email confirms that the request was submitted. The second email from Fleet Services confirms that the request has been received. It can be either approved, denied, or needs additional information. The email is sent to the submitter, requester and driver.</li>\n<li>You can include multiple vehicles and vehicle types as well as drivers.</li>\n<li>Option to request Enterprise departure locations outside of NAU campus.</li>\n<li>NAU as well as outside vendors can provide information about available classes of vehicles.</li>\n<li>Calculator with built-in rates for estimates</li>\n</ul>\n<p>Vehicle Rental Request</p>\n<h2><img loading=\"lazy\" src=\"https://facilities.gatech.edu/sites/default/files/inline-images/Fleet_tire_crop.png\" data-is-external-image=\"true\"  alt=\"Fleet Services\" width=\"80%\" height=\"auto\"></h2>\n<h2>Fleet maintenance and repairs</h2>\n<p>For every vehicle in your fleet, fleet services usually includes comprehensive maintenance and repairs. Keeping a fleet in top condition is what fleet services are designed to do best, and we get a lot of practice. A vehicle that is used to work does not need to be running all day.</p>\n<p>The best way to get years of high-quality service from each vehicle is to stay on top of maintenance, and that's exactly what fleet services were originally designed to do.</p>\n<p>Not every business that needs vehicles has the time or staff to keep a fleet tuned up and in top condition. A fleet service package can help you if your business doesn't have any mechanics. Fleet services professionals will do routine inspections and tuneups, and they can also design easy-to-follow maintenance routines that drivers can do between checkups to keep their vehicles in top condition.</p>\n<h2>Car Wash</h2>\n<p>Go Oil must be paid for at time of service. Payment by P-Cards is acceptable.</p>\n<h2><img loading=\"lazy\" src=\"https://img1.wsimg.com/isteam/ip/fae55827-8ac8-44c5-a4c7-24da1dd3b8ab/AE14AFA5-758C-4339-9D86-7CEFFDE09C23.jpeg/:/cr=t:0%25,l:0%25,w:100%25,h:100%25/rs=h:500,cg:true\" data-is-external-image=\"true\"  alt=\"Fleet Services\" width=\"80%\" height=\"auto\"></h2>\n<h2>Long Term Lease Program</h2>\n<p>Fleet Services can help departments request long-term leasing vehicles instead of buying a vehicle. For more information, please refer to the long-term lease agreement.</p>\n<h2>Licensing and Title Management</h2>\n<p>One of the most tedious aspects of fleet management is keeping track of all the licenses and titles for each vehicle. Go Oil's fleet management services are able to take that burden off of your shoulders. You don't need to be concerned about licenses or titles for the vehicles that make up your fleet.</p>\n<p>An excellent fleet service program will easily make use of the company's vehicle administration solutions in order to ensure that all your fleet vehicles have been licensed and kept up-to-date.</p>\n<h2><img loading=\"lazy\" src=\"https://www.alexandriava.gov/sites/default/files/styles/gallery_item/public/2022-03/Fleet_Services_9.JPG?itok=hAM8sbQg\" data-is-external-image=\"true\"  alt=\"Fleet Services\" width=\"80%\" height=\"auto\"></h2>\n<h2>Hours Of Operation</h2>\n<p>Fleet Services can assist with all your vehicle, equipment and vessel needs. If you have questions, or need additional information, please contact us.</p>\n<h2>Fleet Selection And Aquisition</h2>\n<p>Choosing the right vehicles for your fleet is not always easy. There are many makes and models available, with the manufacturer always having nice words to say about vehicles. But a fleet services expert knows how to select the exact vehicle for each business need.</p>\n<p>They know the difference between a loud engine and hauling power. They can identify the kind of seat needed for all-day drivers versus special assignment drivers. You can tell which vehicles get better mileage in urban areas versus those that are used for rural purposes.</p>\n<h2><img loading=\"lazy\" src=\"https://media-exp2.licdn.com/dms/image/C560BAQFAwVgkvUOZGw/company-logo_200_200/0/1654185603091?e=2147483647&amp;v=beta&amp;t=i9UqMmNxu-vGKnkQC_HT7p9UJiQCY7e_yCyoyU6bbEA\" data-is-external-image=\"true\"  alt=\"Fleet Services\" width=\"80%\" height=\"auto\"></h2>\n<h2>Company-Led Education And Training</h2>\n<p>Cox Automotive Mobility Fleet Services trains, develops, and supports its own highly-skilled workforce to be leaders in the diesel and gas industry.</p>\n<ul>\n<li>You will be able to do both academically and in the field.</li>\n<li>Certification and accreditation through national ASE testing</li>\n<li>Internal testing and continuous post-academic training</li>\n</ul>\n<h2>The Top Fleet Management Questions</h2>\n<p>Chances are, you have asked these questions if you manage or own a fleet. We are here to assist you.</p>\n<p>Check out our frequently asked questions about fleet management</p>\n<h2><img loading=\"lazy\" src=\"https://guardianfleetservice.com/wp-content/uploads/2021/04/3e037205f2d3b359f275b428728d.png\" data-is-external-image=\"true\"  alt=\"Fleet Services\" width=\"80%\" height=\"auto\"></h2>\n<h2>Maintenance and Reporting</h2>\n<ul>\n<li>Complete vehicle maintenance, repair, and inspection based on schedules and requirements.</li>\n<li>For vehicles and equipment, fuel.</li>\n<li>Vehicle asset management, records management, reporting and documentation of all vehicular assets, titles and licensing.</li>\n<li>Retire surplus vehicles.</li>\n</ul>\n<h2>National Billed Fleet</h2>\n<p>Large fleets of over 50 vehicles are best served by this option. It also provides nationwide coverage. This option offers the convenience of consolidated billing and the ability to control maintenance expenses through customized service rules and restrictions.</p>\n<h2><img loading=\"lazy\" src=\"https://www.ge.com/content/dam/gepower-new/global/en_US/images/gas-new-site/services/cross-fleet-service-solutions/hero-cross-fleet-service-solutions-power-plant.jpg\" data-is-external-image=\"true\"  alt=\"Fleet Services\" width=\"80%\" height=\"auto\"></h2>\n<h2>Fleet Services Building (Map).</h2>\n<p>The Fleet Services office (both the shop and rental operations) is closed on all University holidays.</p>",
            "author": {
                "name": "Mechanic"
            },
            "tags": [
            ],
            "date_published": "2022-07-11T22:12:58-07:00",
            "date_modified": "2022-07-12T06:06:29-07:00"
        }
    ]
}
